WB_VertCyl/WB_VertCyl_V9_VM/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "alpha.water.*"
    {
        nAlphaCorr        5;
        nAlphaSubCycles   3;
        cAlpha            1;
        icAlpha           0;
         
       MULESCorr          yes;
       nLimiterIter       5;
       alphaApplyPrevCorr yes;

       solver             smoothSolver;
       smoother           symGaussSeidel;
       tolerance          1e-8;
       relTol             0;
       minIter            1;
    }

    "pcorr.*"
    {
        solver          PCG;

        preconditioner
        {
            preconditioner  GAMG;

            smoother        GaussSeidel;

            tolerance       1e-7;
            relTol          0;
        }
     };

    p_rgh
    {
        solver          GAMG;
        tolerance       1e-7;
        relTol          0.05;
        smoother        DICGaussSeidel;
        nPreSweeps      0;
        nPostSweeps     2;
        cacheAgglomeration true;
        nCellsInCoarsestLevel 50;
        agglomerator    faceAreaPair;
        mergeLevels     1;
    }

    p_rghFinal
    {
        $p_rgh;
        tolerance       1e-7;
        relTol          0;
    }

    "(U|k|epsilon).*"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-6;
        relTol          0;
        minIter         5;
    }

    "(U|k|epsilon)Final"
    {
        $U;
        relTol          0;
    }
}

PIMPLE
{
    momentumPredictor   yes;
    nOuterCorrectors    3;
    nCorrectors         5;
    nNonOrthogonalCorrectors 1;
    
    residualControl
    {
        p_rgh
        {
            tolerance  1e-7;
            relTol     0;
        }
        U
        {
            tolerance  1e-7;
            relTol     0;
        }
        "(k|epsilon)"
        {
            tolerance  1e-6;
            relTol     0;
        }
    }
}

relaxationFactors
{
    fields
    {
        p_rgh           1.0;
        p_rghFinal      1.0;
    }
    equations
    {
        U               1.0;
        k               1.0;
        epsilon         1.0;
    }
}

cache
{
    grad(U);
    grad(p_rgh);
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //